# Pandas tutorials

In [1]:
#import pandas
import pandas as pd
import numpy as np

In [3]:
#play with dataframe
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row4'],columns=['Col1','Col2','Col3','Col4'])

In [4]:
df

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row4    16    17    18    19

In [5]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row4    16    17    18    19

In [6]:
df.to_csv('Test1.csv')

In [7]:
#accessing the elements
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [10]:
#check the type
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[:3,:2]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9

In [14]:
type(df.iloc[:3,:2])

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: Col1, dtype: int32

In [16]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [17]:
df.iloc[:,1:]

      Col2  Col3  Col4
Row1     1     2     3
Row2     5     6     7
Row3     9    10    11
Row4    13    14    15
Row4    17    18    19

In [18]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [19]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [21]:
df['Col1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Col1, dtype: int64

In [22]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

In [23]:
df[['Col1','Col4']]

      Col1  Col4
Row1     0     3
Row2     4     7
Row3     8    11
Row4    12    15
Row4    16    19